tests/sedimMassConservation/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}

// ************************** sediment properties ************************** //

rhoS    [1 -3 0 0 0 0 0] 2600; // sediment density

dS      [0 1 0 0 0 0 0] 2.9e-4; // sediment diameter

CsMax   [0 0 0 0 0 0 0] 0.6; // max volumic sediment concentration

// ************************************************************************* //

transportModel  Newtonian;

nu      nu [ 0 2 -1 0 0 0 0 ] 1e-06;  // kinetmatic fluid viscosity

Sc      1; // Schmidt number

// ************************************************************************* //
