tests/sedimMassConservation/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale       1;


height      0.5;
width       0.1;


vertices        
(
    (0 0 0) //0
    ($width 0 0) //1
    ($width $width 0) //2
    (0 $width 0) //3
    (0 0 $height) //4
    ($width 0 $height) //5
    ($width $width $height) //6
    (0 $width $height) //7
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (1 1 20) simpleGrading (1 1 1)
);

edges           
(
);

boundary         
(
    top
    {
        type patch;
        faces
            (
                (4 5 6 7)
            );
    }
    bed
    {
        type wall;
        faces
            (
                (3 2 1 0)
            );
    }
    sides
    {
        type empty;
        faces
            (
                (0 1 5 4)
                (3 7 6 2)
                (0 3 7 4)
                (1 2 6 5)
            );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
